Repository: alleey/flutter-guesstheword
Catalog: assets/l10n/app_*.arb
Languages: ur

# app_title
source: Guess The Word
ur: لفظ کا اندازہ لگائیں

# home_loading
source: loading . . .
ur: لوڈ ہو رہا ہے . . .

# game_loading
source: almost there . . .
ur: تقریباً پہنچ گئے . . .

# game_input_title
source: Pick your letters wisely
ur: اپنے حروف دانشمندی سے منتخب کریں

# game_input_findmore
source: Find more about
ur: مزید جانیں

# game_puzzle_usehint
source: Use a Hint
ur: ایک اشارہ استعمال کریں

# game_top_gonext
source: Go Next
ur: آگے بڑھیں

# dlg_popup_title
source: Processing ...
ur: پروسیسنگ ...

# dlg_popup_wait_reset
source: Please wait while the game is reset ...
ur: براہ کرم انتظار کریں جب تک کہ کھیل دوبارہ شروع ہو رہا ہے ...

# dlg_help_title
source: How to Play
ur: لفظ کا اندازہ لگائیں

# dlg_help_intro
source: Find all letters of the word to win the game. Start with the most likely letters. When available, using a hint token can reveral a random letter.
ur: کھیل جیتنے کے لیے لفظ کے تمام حروف تلاش کریں۔ سب سے زیادہ ممکنہ حروف سے شروع کریں۔ جب دستیاب ہو، ایک اشارہ ٹوکن استعمال کر کے ایک تصادفی حرف ظاہر کر سکتا ہے۔

# dlg_help_rule1
source: Score is calculated as the number of lives multiplied by the length of the puzzle.
ur: اسکور کا حساب زندگیاں کی تعداد کو پہیلی کی لمبائی سے ضرب دے کر کیا جاتا ہے۔

# dlg_help_rule2
source: A hint token is awarded for every {scoreBumpForHintBonus} points earned.
ur: ہر {scoreBumpForHintBonus} پوائنٹس حاصل کرنے پر ایک اشارہ ٹوکن دیا جاتا ہے۔

# dlg_help_rule2_1
source: Hint tokens are carried forward even if you reset the game.
ur: اشارہ ٹوکن اس وقت بھی رہتے ہیں جب آپ کھیل کو دوبارہ ترتیب دیں۔

# dlg_help_ok
source: Close
ur: بند کریں

# dlg_settings_title
source: Settings
ur: ترتیبات

# dlg_settings_selecttheme
source: Change Theme
ur: تھیم تبدیل کریں

# dlg_settings_chooselanguage
source: Language
ur: زبان

# dlg_settings_sound
source: Play sounds
ur: آوازیں چلائیں

# dlg_settings_sound_enable
source: Yes
ur: ہاں

# dlg_settings_sound_disable
source: No
ur: نہیں

# dlg_settings_ok
source: Close
ur: بند کریں

# dlg_reset_title
source: RESET GAME
ur: کھیل دوبارہ ترتیب دیں

# dlg_reset_intro
source: Resetting the game will reset all puzzles already finished. High scores will be preserved
ur: کھیل کو دوبارہ ترتیب دینے سے تمام مکمل شدہ پہیلیاں دوبارہ ترتیب دی جائیں گی۔ اعلیٰ اسکور محفوظ رہیں گے

# dlg_reset_question
source: Would you like to reset the game?
ur: کیا آپ کھیل کو دوبارہ ترتیب دینا چاہتے ہیں؟

# dlg_reset_yes
source: Yes
ur: ہاں

# dlg_reset_no
source: No
ur: نہیں

# dlg_needreset_title
source: Congratulations
ur: مبارک ہو

# dlg_needreset_newhigh
source: NEW HIGH SCORE!
ur: نیا اعلیٰ اسکور!

# dlg_needreset_message
source: That was an amazing run. A pat on the back for finishing all the puzzles; the game will now reset. Ready for another round of challenges?
ur: یہ ایک شاندار رن تھا۔ تمام پہیلیاں ختم کرنے کے لیے آپ کی پیٹھ پر ایک تھپکی؛ کھیل اب دوبارہ ترتیب دے گا۔ چیلنجوں کے ایک اور دور کے لیے تیار؟

# dlg_needreset_ok
source: Continue
ur: جاری رکھیں

# dlg_scores_title
source: HIGH SCORES
ur: اعلیٰ اسکور

# dlg_scores_norecord
source: No score has been recorded yet. Win some puzzles to record a score!
ur: ابھی تک کوئی اسکور ریکارڈ نہیں ہوا ہے۔ کچھ پہیلیاں جیتیں تاکہ اسکور ریکارڈ کیا جا سکے!

# dlg_scores_intro
source: Showing best {maxScoreHistory} scores ever
ur: ہمیشہ کے بہترین {maxScoreHistory} اسکور دکھا رہے ہیں

# dlg_scores_winrate
source: Win%
ur: جیت%

# dlg_scores_accuracy
source: Acc.
ur: درستگی

# dlg_scores_won
source: Won
ur: جیتا

# dlg_scores_score
source: Score
ur: اسکور

# dlg_scores_lost
source: Lost
ur: ہار گیا

# dlg_scores_ok
source: Close
ur: بند کریں

# dlg_playerstats_title
source: PERFORMANCE
ur: کارکردگی

# dlg_playerstats_norecord
source: No score has been recorded yet. Win some puzzles to record a score!
ur: ابھی تک کوئی اسکور ریکارڈ نہیں ہوا ہے۔ کچھ پہیلیاں جیتیں تاکہ اسکور ریکارڈ کیا جا سکے!

# dlg_playerstats_intro
source: Performance per type of puzzle
ur: پہیلی کی قسم کے مطابق کارکردگی

# dlg_playerstats_wins
source: {value} won
ur: {value} جیتا

# dlg_playerstats_losses
source: {value} lost
ur: {value} ہار گیا

# dlg_playerstats_winrate
source: Win%
ur: جیت%

# dlg_playerstats_accuracy
source: Acc.
ur: درستگی

# dlg_playerstats_won
source: Won
ur: جیتا

# dlg_playerstats_category
source: Puzzle Type
ur: پہیلی کی قسم

# dlg_playerstats_lost
source: Lost
ur: ہار گیا

# dlg_playerstats_ok
source: Close
ur: بند کریں
